#+TITLE: Purifier panel connection piping system engineering note
#+LATEX_CLASS_OPTIONS: [titlepage]
#+OPTIONS: toc:nil tex:t
#+PROPERTY: header-args:python :session *python-PSEN* :results output raw :exports results

#+MACRO: SYS_NAME purifier panel connection piping
#+MACRO: P_ID FXXXXXX

#+TOC: headlines 2
\newpage{}
#+begin_src sh :exports none
killall python
#+end_src

#+RESULTS:

#+begin_src python :exports none
  import heat_transfer as ht
  ureg = ht.ureg
  Q_ = ht.Q_

  class Material():
      """Basic material class."""
      def __init__(self, name):
          self.name = name  # will be used in property calculations

      def kappa(self, T1, T2=None):
          """Calculate temperature conductivity at a given temperature."""
          return ht.nist_property(self.name, 'TC', T1, T2)

      def lin_exp(self, T):
          """Calculate linear expansion for given temperature"""
          try:
              return ht.nist_property(self.name, 'LE', T)
          except KeyError:
              return ht.nist_property(self.name, 'EC', 293*ureg.K, T)*(T-293*ureg.K)

  steel = Material('304SS')
  steel.rho = Q_('7859 kg/m**3')
  steel.S = Q_('16700 psi')  # 304L SS allowable stress
  steel.nu = 0.3  # Poisson's ratio
  steel.T_min = Q_('-425 degF')

  copper = Material('copper')
  copper.S = Q_('6000 psi')
  copper.T_min = Q_('-452 degF')

  P_des = 250 * ureg.psig
  T_des = 4.5 * ureg.K

  pipes = [ht.piping.CopperTube(3/4, 'Type K'),
           ht.piping.CopperTube(1, 'Type K')]
  for pipe in pipes:
    pipe.material = copper
#+end_src

#+RESULTS:
: Python 3.7.0 (default, Aug  2 2018, 21:46:10)
: [Clang 9.1.0 (clang-902.0.39.2)] on darwin
: Type "help", "copyright", "credits" or "license" for more information.
: python.el: native completion setup failed, <class 'ImportError'>: dlopen(/Users/skoshelev/.pyenv/versions/3.7.0/lib/python3.7/lib-dynload/readline.cpython-37m-darwin.so, 2): Library not loaded: /usr/local/opt/readline/lib/libreadline.7.dylib
:   Referenced from: /Users/skoshelev/.pyenv/versions/3.7.0/lib/python3.7/lib-dynload/readline.cpython-37m-darwin.so
:   Reason: image not found

* Introduction
This document constitutes the piping engineering note for {{{SYS_NAME}}}.

The {{{SYS_NAME}}} consists of copper tubing and fittings connecting the purifier panel to different part of IB1 cryosystem, such as: storage dewar, distribution box, horizontal test stands, Mycom and Sullair compressor suction, and buffer tanks. Buffer tanks are associated with the highest pressure the {{{SYS_NAME}}} is exposed to driving the design pressure.

The design pressure for {{{SYS_NAME}}} is src_python{print(f'{P_des.to(ureg.psig):.3g~}')} {{{results(=250 psig=)}}}.


The P&ID of the {{{SYS_NAME}}} is shown in Figure [[fig:P_ID]]. Drawings of the standalone bayonet and the U-tube a presented in Appendix 10.4, page 11.

#+CAPTION: The {{{SYS_NAME}}} as shown on P&ID {{{P_ID}}}.
#+NAME: fig:P_ID
[[./images/P_ID]]

* Design codes and evaluation criteria
All the piping must meet all of the requirements of Section 5031.1 of the Fermilab ES&H Manual.
#+begin_src python
  print('This section states that piping systems containing gas at a pressure ')
  if P_des > 150 * ureg.psig or T_des < -20 * ureg.degF:
      print('above 150 psig or a temperature below -20 Fahrenheit fall under the category of Normal Fluid Service ')
  else:
      print('below 150 psig and a temperature above -20 Fahrenheit fall under the Category D Fluid Service ')
  print('and shall adhere to the requirements of the ASME Process Piping Code B31.3.')
#+end_src

#+RESULTS:
: This section states that piping systems containing gas at a pressure
: above 150 psig or a temperature below -20 Fahrenheit fall under the category of Normal Fluid Service
: and shall adhere to the requirements of the ASME Process Piping Code B31.3.

* Materials
The tubing including fittings are fabricated from
#+begin_src python
print(pipes[0].material.name+'.')
#+end_src

#+RESULTS:
: Copper.

The respective allowable stress from Table A-1 of ASME B31.3 will be used in this analysis.

The {{{SYS_NAME}}} will be operated at temperatures down to src_python{print(f'{T_des.to(ureg.K):.3g~} ({T_des.to(ureg.degF):.3g})')} {{{results(=4.5 K (-452 degF)=)}}}.
#+begin_src python
  if any(T_des < pipe.material.T_min for pipe in pipes):
    print('This is below the minimum temperature listed for any stainless steel pipe or tube. According to B31.3 Section 323.2.2, impact testing is required for this material except as stated in Table 323.2.2 Note (6) where impact testing is not required when the minimum obtainable Charpy specimen has a width along the notch of less than 2.5 mm (0.098 in).')
    if not any(pipe.wall >= 0.098*ureg.inch for pipe in pipes):
      print('All of the tubing and piping with design minimum temperature below -20 F used in the {{{SYS_NAME}}} has a wall thickness of less than 0.098 in. Therefore, impact testing is not required for this piping system.')

#+end_src

#+RESULTS:

#+begin_comment
It should also be noted that Fermilab has extensive service experience using the 300 series stainless steel at liquid nitrogen temperatures and below.
Wall thickness of the 1.5” SCH 10 pipe is 0.109” which is greater than minimum obtainable Charpy specimen. According to Policy for Fracture Toughness Testing Requirements for Pressure Systems and Components at Low Cryogenic Temperatures  from 5/7/2010 recommends:
“As an alternative to B31.3 323.2.2 and Table 323.2.2 cells A‐4 and B‐4, high alloy steel materials (austenitic stainless steels) listed in Section VIII Div 1 Table UHA‐ 23 used in cryogenic piping with MDMTs colder than 77 K may instead be subjected to all requirements of UHA‐51.”
UHA-51 (g) exempts from impact testing materials listed in Table UHA-23, except as modified by UHA-51 (c), when ratio of design stress to allowable stress is less than 0.35. UHA-51 (c) (1) requires impact testing if the material has been thermally treated at temperatures between 900 F and 1650 F for austenitic steel. Off-the-shelf 304 and 316 steel is subject to annealing at temperatures above 1800 F and, therefore, is exempt from this requirement. As shown in Table 4.1, design stress to allowable stress ratio is less than 0.35 and impact testing is not required.
Minimum design temperature of He piping is 77 K. According to “Charpy Impact Testing at LN2 Temperature” Memo (ED0004216):
“All Charpy impact testing requirements have been satisfied for using 304 and 304L piping components with 308L filler metal and a wall thickness of less than 0.359”.  The extensive and successful experience Fermilab has had with the materials listed above has been reinforced with successful Charpy impact testing.  No further testing should be required for most LN2 piping assemblies fabricated by AD/Cryo as long as thickness requirements are met.”
All piping has wall thickness less than 0.359” and satisfies this requirement.
#+end_comment
Table [[tab:allowable_stress]] summarizes the materials used and the allowable stresses from B31.3 Table A-1.

#+begin_src python :results table :colnames '("Component"	"Material"	"Allowable Stress, psi")
  print([[pipes[0].type, pipes[0].material.name, f'{pipes[0].material.S.to(ureg.psi).magnitude:.0f}'], ['', '', '']])
#+end_src

#+CAPTION: Materials and Allowable Stress Values
#+NAME: tab:allowable_stress
#+RESULTS:
| Component          | Material | B31.3 Table A-1 Allowable Stress [psi] |
|--------------------+----------+----------------------------------------|
| Copper tube Type K | Copper   |                                   6000 |
|                    |          |                                        |

* Piping design and analysis
The minimum required wall thickness is calculated using B 31.3 304.1.2 and is shown in Table [[tab:pipe_wall]].

$$t=\frac{PD}{2(SEW+PY)}$$
#+begin_src python :results table :colnames '("Piping/tubing size	D, in"	"Min wall thick, in"	"Act thick, in"	"Wall thick ratio")
  E = 1
  W = 1
  Y = 0.4
  table = []
  for pipe in pipes:
    pipe.update(S=pipe.material.S, E=E, W=W, Y=Y)
    D = str(pipe.D) + '", ' + pipe.type
    t_min = pipe.pressure_design_thick(P_des)
    t_min_s = f'{t_min.to(ureg.inch).magnitude:.3g}'
    t_a = pipe.wall
    t_a_s = f'{t_a.to(ureg.inch).magnitude:.3g}'
    ratio = (t_a/t_min).to_base_units()
    ratio_s = f'{ratio:.3g~}'
    table.append([D, t_min_s, t_a_s, ratio_s])
  print(table)

#+end_src

#+CAPTION: Minimum required and actual wall thicknesses
#+NAME: tab:pipe_wall
#+RESULTS:
| Piping/tubing size	D, in | Min wall thick, in | Act thick, in | Wall thick ratio |
|---------------------------+--------------------+---------------+------------------|
| 0.75", Copper tube Type K |             0.0179 |         0.065 |             3.63 |
| 1", Copper tube Type K    |             0.0231 |         0.065 |             2.82 |


#+begin_src python :results table
table = []
table.append(['P = ', f'{P_des:.3g~}', 'Design pressure'])
table.append(['S = ', f'{pipes[0].material.S:.0f~}', 'Allowable stress, B31.3 A-1'])
table.append(['E = ', f'{E:.3g}', 'Quality factor, B31.3 A-1A, A-1B'])
table.append(['W = ', f'{W:.3g}', 'Weld joint stress reduction factor, B31.3 302.3.5(e)'])
table.append(['Y = ', f'{Y:.3g}', 'Coefficient, B31.3 304.1.1'])
print(table)
#+end_src

#+CAPTION: Values for wall thickness calculation
#+NAME: tab:des_parameters
#+RESULTS:
| P = | 250 psig | Design pressure                                      |
| S = | 6000 psi | Allowable stress, B31.3 A-1                          |
| E = |        1 | Quality factor, B31.3 A-1A, A-1B                     |
| W = |        1 | Weld joint stress reduction factor, B31.3 302.3.5(e) |
| Y = |      0.4 | Coefficient, B31.3 304.1.1                           |

All piping complies with this requirement.


Listed components manufactured in accordance with the codes required by B31.3 Table 326.1 are presented in Table [[tab:listed]].
#+begin_comment
Unlisted components, those not included in B31.3 Table 326.1 as being manufactured according to published standards, installed in the {{{SYS_NAME}}} are shown in Table [[tab:unlisted]].
#+end_comment

#+begin_comment
Extensive service experience at Fermilab allows the use of these components in piping systems as per B31.3 Section 304.7.2.
#+end_comment

#+begin_src python :results table :colnames '("Component" "Source and P/N" "Pressure rating, psig" "Design pressure, psig")
  table = []
  table.append(['Elbow', '', 582, f'{P_des.to(ureg.psig).magnitude:.3g}'])
  print(table)
#+end_src

#+CAPTION: Listed piping components.
#+NAME: tab:listed
#+RESULTS:
| Component | Source and P/N | Pressure rating, psig | Design pressure, psig |
|-----------+----------------+-----------------------+-----------------------|
| Elbow     |                |                   582 |                   250 |

#+begin_comment
#+CAPTION: Unlisted piping components.
#+NAME: tab:unlisted

Component	Source and part number	Internal pressure rating [psig]	System design internal pressure [psig]	Comment
Braided hose	Hose Master Annuflex #AF4750 3/4“ 321 single wire braid	898	60	304.7.2(a) Extensive service experience.
1” x 1/2" Hex reducing bushing	McMaster Carr pt# 4464K644	3000	60	304.7.2(a) Extensive service experience.
Half coupling 1”	McMaster Carr pt# 45525K576	1270	60	304.7.2(a) Extensive service experience.
Union, 1/2” NPS	HART ind P/N 3333-3-V-304L	3000	60	304.7.2(a) Extensive service experience.
Socket weld gland ZCR	Hy-lok
H-ZSG-8S	3500	60	304.7.2(a) Extensive service experience.
Male Socket weld Gland	Hy-lok
H-ZGM-8-B-SM6L	3500	60	304.7.2(a) Extensive service experience.
Vacuum coupling sleeve	Fermilab	67001	60	304.7.2(a) Extensive service experience.
ZCR NPT 1/2” connector	Hy-lok
H-ZMC-8-8N	4300	60	304.7.2(a) Extensive service experience.
  Internal design gauge pressure according to B 31.3 304.1.2(a) based on minimal wall thickness.
#+end_comment

* Pressure relief system
The {{{SYS_NAME}}} is protected by SV-1601, and SV-1602.
#+begin_comment
Supporting calculations are included in Appendix 10.3, page 11.
#+end_comment

* Flexibility analysis
The {{{SYS_NAME}}} is operated at a room temperature thus no flexibility calculations are required.

* Welding and inspection
All brazing is made and certified by Fermilab. Completed inspection forms are included in the Appendix [[*Weld inspection forms]].

* Pressure testing
#+begin_comment
345.2.5 for jacketed piping
67.5 psig with insulating vacuum
#+end_comment
The {{{SYS_NAME}}} will be pressure tested in accordance with B31.3 345.5.4. For a pneumatic test, the test pressure is 110% of the design pressure (src_python{print(f'{P_des:.3g~}')}) or src_python{print(f'{1.1*P_des:.3g~}')}. The test medium will be gaseous helium.  After this document is reviewed and the pressure tests completed, copies of the witnessed pressure test permits will be included in the Appendix [[*Pressure testing permits]].

* Summary
The design of the {{{SYS_NAME}}} documented in this note is adequate to ensure that its operation presents no hazards to personnel.

* Appendix
(Pressure test permits will be appended after this note is approved and the pressure tests are completed.)
** Weld inspection forms
** Pressure testing permits
** Safety valve supporting calculations


** Supporting drawings
